{
  "backend/main.mo": "Main backend actor implementing film storage with uploadFilm and getFilm methods, using MixinStorage for blob handling and a Map to store Film records keyed by Principal (caller ID).",
  "feature_evidence.json": "Feature evidence report documenting five main features (Netflix-inspired design, film upload, browsing interface, video playback, and branding) with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON object containing summaries of all frontend source files including components, pages, hooks, and configuration files with implementation details and bug fixes noted.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color palettes using OKLCH color space, including Netflix-inspired dark backgrounds and accent colors.",
  "frontend/index.html": "HTML entry point with basic meta tags, 'Notflix' title, root div for React mounting, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with three routes (browse, upload, player) and ThemeProvider forcing dark mode theme.",
  "frontend/src/components/FilmRow.tsx": "Horizontal scrolling film carousel component with left/right navigation buttons, smooth scrolling behavior, and responsive thumbnail display using FilmThumbnail components.",
  "frontend/src/components/FilmThumbnail.tsx": "Film thumbnail card with hover effects showing title/description overlay, click navigation to player page, and fallback to placeholder image on error.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright notice and 'Built with caffeine.ai' attribution link with UTM tracking parameters.",
  "frontend/src/components/HeroBanner.tsx": "Hero banner component with background image, gradient overlays, title, description, and action buttons (Play and More Info) in Netflix style.",
  "frontend/src/components/Logo.tsx": "Reusable Notflix logo component rendering generated logo image with configurable size variants (sm, md, lg).",
  "frontend/src/components/Navbar.tsx": "Fixed navigation bar with Notflix logo, Home/Upload links, and Upload Film button using gradient background for Netflix-style appearance.",
  "frontend/src/components/UploadFilmForm.tsx": "React form component for uploading films with title, description, thumbnail, and video file inputs. Handles authentication check, file upload with progress tracking using ExternalBlob, and redirects to home after successful upload.",
  "frontend/src/components/VideoPlayer.tsx": "Full-featured video player component with play/pause, seek, volume controls, fullscreen support, and auto-hiding controls. Displays loading state and formats time display for the video progress.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an authenticated or anonymous actor instance based on Internet Identity login state. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality. Manages AuthClient creation, identity state, and login status throughout the authentication lifecycle.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching individual films, uploading films, and managing a client-side films list stored in localStorage. Includes helper function to add films to the local list.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes using Notflix branding colors (black, dark, red, gray). Includes utility classes for hiding scrollbars.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/BrowsePage.tsx": "Main browse page displaying navbar, hero banner, and film rows. Fetches film list from localStorage and loads up to 10 films using individual useGetFilm hooks.",
  "frontend/src/pages/PlayerPage.tsx": "Video player page that extracts filmId from URL params, fetches the film data, and renders VideoPlayer component. Handles loading, error, and not-found states.",
  "frontend/src/pages/UploadPage.tsx": "React page component that renders the film upload interface with a centered layout including Navbar, UploadFilmForm component, and Footer.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, including Netflix-inspired theme colors (notflix-black, notflix-red, etc.), animations, and responsive container settings.",
  "project_state.json": "Project metadata file defining Notflix as a Netflix parody app with five existing features (UI design, upload, browsing, playback, branding) and tracking architectural notes and image requirements."
}